Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.TooManyFacesEdges
This family instance has too many [Edges and Faces].  Remove unnecessary geometry or split the instance into multiple instances.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SymbolicLineInvalidPlane
Symbolic Element refers to a Work Plane with unacceptable normal.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SuccessToConvertLine
Success to convert lines

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SiteInvisible
Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.PolygonSegmentTooShort
Polygon segment too short

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.OffsetFaceFailed
Failed to offset the face.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.LineArcTangentFailure
Can't keep arc element and straight line element tangent.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailedUpdateCurveChain
Failed to update curve chain.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailedReplaceCurveElemCurveDriver
Failed to replace curve elem curve driver.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailToConvertLine
Unable to convert lines

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.ElementTooSmall
Element is too small on screen

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.ElementIsTooThin
[Element] is too thin.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveProjectTooShort
The projection of the line in this view is too short to create a new Line

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveDriverError
Element's internal join data is corrupt.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveAndSurfaceDoNotIntersect
Curve and Surface do not intersect.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.ConvertFaceRegionsToFacesFailed
Failed to replace an instance face with its face regions.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.ConvertFaceRegionsToFacesCrashed
Failed to replace an instance face with its face regions.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CannotFindClosest
Cannot find closest points within lines.

Autodesk.Revit.DB.BuiltInFailures.GeometryFailures
Failures about GeometryFailures.